TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_i2s0.h
/*****************************************************************************

  Copyright (C) 2025 Texas Instruments Incorporated - http://www.ti.com/ 

  Redistribution and use in source and binary forms, with or without 
  modification, are permitted provided that the following conditions 
  are met:

   Redistributions of source code must retain the above copyright 
   notice, this list of conditions and the following disclaimer.

   Redistributions in binary form must reproduce the above copyright
   notice, this list of conditions and the following disclaimer in the 
   documentation and/or other materials provided with the   
   distribution.

   Neither the name of Texas Instruments Incorporated nor the names of
   its contributors may be used to endorse or promote products derived
   from this software without specific prior written permission.

  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS 
  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT 
  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT 
  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, 
  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT 
  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT 
  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE 
  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.

*****************************************************************************/

#ifndef ti_devices_msp_peripherals_hw_i2s0__include
#define ti_devices_msp_peripherals_hw_i2s0__include

/* Filename: hw_i2s0.h */
/* Revised: 2025-04-09 13:57:08 */
/* Revision: f4602b816b1643a266cc7aae6be755d35f394359 */

#ifndef __CORTEX_M
  #ifdef __cplusplus
    #define __I  volatile        /*!< Defines 'read only' permissions */
  #else
    #define __I  volatile const  /*!< Defines 'read only' permissions */
  #endif
  #define __O  volatile          /*!< Defines 'write only' permissions */
  #define __IO  volatile         /*!< Defines 'read / write' permissions */

  /* following defines should be used for structure members */
  #define __IM  volatile const   /*! Defines 'read only' structure member permissions */
  #define __OM  volatile         /*! Defines 'write only' structure member permissions */
  #define __IOM  volatile        /*! Defines 'read / write' structure member permissions */
#endif

/* Use standard integer types with explicit width */
#include <stdint.h>

#ifdef __cplusplus
 extern "C" {
#endif

#if defined ( __CC_ARM )
#pragma anon_unions
#endif

/******************************************************************************
* I2S0 Registers
******************************************************************************/
#define I2S0_SPGDMA_OFS                          ((uint32_t)0x000010B0U)
#define I2S0_CPU_INT_OFS                         ((uint32_t)0x00001020U)
#define I2S0_GPRCM_OFS                           ((uint32_t)0x00000800U)


/** @addtogroup I2S0_SPGDMA
  @{
*/

typedef struct {
  __IO uint32_t SPGDMARXSZ;                        /* !< (@ 0x000010B0) DMA Channel Size */
  __IO uint32_t SPGDMARXDA;                        /* !< (@ 0x000010B4) DMA Channel Destination Address */
  __IO uint32_t SPGDMARXCTL;                       /* !< (@ 0x000010B8) DMA Channel Control */
       uint32_t RESERVED0;
  __IO uint32_t SPGDMATXSZ;                        /* !< (@ 0x000010C0) DMA Channel Size */
  __IO uint32_t SPGDMATXSA;                        /* !< (@ 0x000010C4) DMA Channel Destination Address */
  __IO uint32_t SPGDMATXCTL;                       /* !< (@ 0x000010C8) DMA Channel Control */
} I2S0_SPGDMA_Regs;

/*@}*/ /* end of group I2S0_SPGDMA */

/** @addtogroup I2S0_CPU_INT
  @{
*/

typedef struct {
  __I  uint32_t IIDX;                              /* !< (@ 0x00001020) Interrupt index */
       uint32_t RESERVED0;
  __IO uint32_t IMASK;                             /* !< (@ 0x00001028) Interrupt Mask Register  Selects mask states of
                                                      the flags in [IRQFLAGS.*] that contribute to the **I2S_IRQ** event. */
       uint32_t RESERVED1;
  __I  uint32_t RIS;                               /* !< (@ 0x00001030) This registers gives the raw interrupt status */
       uint32_t RESERVED2;
  __I  uint32_t MIS;                               /* !< (@ 0x00001038) This registers gives the raw interrupt status */
       uint32_t RESERVED3;
  __O  uint32_t ISET;                              /* !< (@ 0x00001040) Interrupt Set Register. This register can be used
                                                      by software for diagnostics and safety checking purposes. */
       uint32_t RESERVED4;
  __O  uint32_t ICLR;                              /* !< (@ 0x00001048) Interrupt clear register. This register allows
                                                      software to clear interrupts. */
} I2S0_CPU_INT_Regs;

/*@}*/ /* end of group I2S0_CPU_INT */

/** @addtogroup I2S0_GPRCM
  @{
*/

typedef struct {
  __IO uint32_t PWREN;                             /* !< (@ 0x00000800) Power enable */
  __O  uint32_t RSTCTL;                            /* !< (@ 0x00000804) Reset Control */
  __IO uint32_t CLKCFG;                            /* !< (@ 0x00000808) Peripheral Clock Configuration Register */
       uint32_t RESERVED0[2];
  __I  uint32_t STAT;                              /* !< (@ 0x00000814) Status Register */
} I2S0_GPRCM_Regs;

/*@}*/ /* end of group I2S0_GPRCM */

/** @addtogroup I2S0
  @{
*/

typedef struct {
       uint32_t RESERVED0[512];
  I2S0_GPRCM_Regs  GPRCM;                             /* !< (@ 0x00000800) */
       uint32_t RESERVED1[508];
  __IO uint32_t PDBGCTL;                           /* !< (@ 0x00001008) Peripheral Debug Control */
       uint32_t RESERVED2[5];
  I2S0_CPU_INT_Regs  CPU_INT;                           /* !< (@ 0x00001020) */
       uint32_t RESERVED3[25];
  I2S0_SPGDMA_Regs  SPGDMA;                            /* !< (@ 0x000010B0) */
       uint32_t RESERVED4[6];
  __O  uint32_t INTCTL;                            /* !< (@ 0x000010E4) Interrupt control register */
       uint32_t RESERVED5[6];
  __IO uint32_t FMTCFG;                            /* !< (@ 0x00001100) This register configures the serial interface
                                                      format */
  __IO uint32_t CLKCTL;                            /* !< (@ 0x00001104) This register controls internal audio clock */
  __I  uint32_t STAT;                              /* !< (@ 0x00001108) UART Status Register */
  __IO uint32_t IFLS;                              /* !< (@ 0x0000110C) UART Interrupt FIFO Level Select Register */
  __IO uint32_t WCLKSRC;                           /* !< (@ 0x00001110) This register configures the **WCLK** Source */
       uint32_t RESERVED6;
  __IO uint32_t DIRCFG;                            /* !< (@ 0x00001118) This register configures the direction of data
                                                      pins(**AD0**/**AD1**) */
       uint32_t RESERVED7;
  __O  uint32_t TXDATA;                            /* !< (@ 0x00001120) UART Transmit Data Register */
  __I  uint32_t RXDATA;                            /* !< (@ 0x00001124) UART Receive Data Register */
       uint32_t RESERVED8[8];
  __IO uint32_t WMASK0;                            /* !< (@ 0x00001148) This register configures the word selection dit
                                                      mask for data pin 0(**AD0**) */
  __IO uint32_t WMASK1;                            /* !< (@ 0x0000114C) This register configures the word selection dit
                                                      mask for data pin 1(**AD1**) */
       uint32_t RESERVED9[4];
  __IO uint32_t MCLKDIV;                           /* !< (@ 0x00001160) This field configures **MCLK** division ratio */
  __IO uint32_t WCLKDIV;                           /* !< (@ 0x00001164) Configures WCLK division ratio */
  __IO uint32_t BCLKDIV;                           /* !< (@ 0x00001168) This field configures **BCLK** division ratio */
} I2S0_Regs;

/*@}*/ /* end of group I2S0 */



#if defined ( __CC_ARM )
#pragma no_anon_unions
#endif

