TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_i2s0.h
/******************************************************************************
* I2S0 Register Control Bits
******************************************************************************/

/* I2S0_SPGDMARXSZ Bits */
/* I2S0_SPGDMARXSZ[SIZE] Bits */
#define I2S0_SPGDMARXSZ_SIZE_OFS                 (0)                             /* !< SIZE Offset */
#define I2S0_SPGDMARXSZ_SIZE_MASK                ((uint32_t)0x0000FFFFU)         /* !< DMA Channel Size in number of
                                                                                    transfers */
#define I2S0_SPGDMARXSZ_SIZE_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2S0_SPGDMARXSZ_SIZE_MAXIMUM             ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* I2S0_SPGDMARXDA Bits */
/* I2S0_SPGDMARXDA[ADDR] Bits */
#define I2S0_SPGDMARXDA_ADDR_OFS                 (0)                             /* !< ADDR Offset */
#define I2S0_SPGDMARXDA_ADDR_MASK                ((uint32_t)0xFFFFFFFFU)         /* !< DMA Channel Destination Address */
#define I2S0_SPGDMARXDA_ADDR_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2S0_SPGDMARXDA_ADDR_MAXIMUM             ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* I2S0_SPGDMARXCTL Bits */
/* I2S0_SPGDMARXCTL[DMAEN] Bits */
#define I2S0_SPGDMARXCTL_DMAEN_OFS               (1)                             /* !< DMAEN Offset */
#define I2S0_SPGDMARXCTL_DMAEN_MASK              ((uint32_t)0x00000002U)         /* !< DMA enable */
#define I2S0_SPGDMARXCTL_DMAEN_DISABLE           ((uint32_t)0x00000000U)         /* !< DMA channel disabled */
#define I2S0_SPGDMARXCTL_DMAEN_ENABLE            ((uint32_t)0x00000002U)         /* !< DMA channel enabled */
/* I2S0_SPGDMARXCTL[DMAMEMINCR] Bits */
#define I2S0_SPGDMARXCTL_DMAMEMINCR_OFS          (20)                            /* !< DMAMEMINCR Offset */
#define I2S0_SPGDMARXCTL_DMAMEMINCR_MASK         ((uint32_t)0x00100000U)         /* !< DMA destination increment. This bit
                                                                                    selects automatic incrementing or
                                                                                    decrementing of the destination
                                                                                    address DMADA for each transfer. The
                                                                                    amount of change to the DMADA is
                                                                                    based on the definitin in the
                                                                                    DMADSTWDTH. For example an increment
                                                                                    of 1 (+1) on a WORD transfer will
                                                                                    increment the DMADA by 4. */
#define I2S0_SPGDMARXCTL_DMAMEMINCR_INCREMENT    ((uint32_t)0x00000000U)         /* !< Incremented by 1 (+1 * DMADSTWDTH) */
#define I2S0_SPGDMARXCTL_DMAMEMINCR_DECREMENT    ((uint32_t)0x00100000U)         /* !< Decremented by 1 (-1 * DMADSTWDTH) */
/* I2S0_SPGDMARXCTL[DMAPREIRQ] Bits */
#define I2S0_SPGDMARXCTL_DMAPREIRQ_OFS           (24)                            /* !< DMAPREIRQ Offset */
#define I2S0_SPGDMARXCTL_DMAPREIRQ_MASK          ((uint32_t)0x01000000U)         /* !< Enable an early IRQ event. This can
                                                                                    help software to react quicker to and
                                                                                    DMA done event or allows some
                                                                                    additional configuration before the
                                                                                    channel is complete.   Note: This
                                                                                    register is only available in a
                                                                                    FULL-channel configuration. Please
                                                                                    consult the datasheet of the specific
                                                                                    device to map which channel number
                                                                                    has FULL or BASIC capability. In a
                                                                                    BASIC configuration this register is
                                                                                    a read only value and always reads as
                                                                                    0x0. */
#define I2S0_SPGDMARXCTL_DMAPREIRQ_PREIRQ_DISABLE ((uint32_t)0x00000000U)         /* !< Pre-IRQ event disabled. */
#define I2S0_SPGDMARXCTL_DMAPREIRQ_PREIRQ_HALF   ((uint32_t)0x01000000U)         /* !< Issure Pre-IRQ event when DMASZ
                                                                                    reached the half size point of the
                                                                                    original transfer size */
/* I2S0_SPGDMARXCTL[DMATM] Bits */
#define I2S0_SPGDMARXCTL_DMATM_OFS               (27)                            /* !< DMATM Offset */
#define I2S0_SPGDMARXCTL_DMATM_MASK              ((uint32_t)0x08000000U)         /* !< DMA transfer mode register */
#define I2S0_SPGDMARXCTL_DMATM_SINGLE            ((uint32_t)0x00000000U)         /* !< Single transfer. Each transfers
                                                                                    requires a new trigger. When the
                                                                                    DMASZ counts down to zero an event
                                                                                    can be generated and the DMAEN is
                                                                                    cleared. */
#define I2S0_SPGDMARXCTL_DMATM_RPTSNGL           ((uint32_t)0x08000000U)         /* !< Repeated single transfer. Each
                                                                                    transfers requires a new trigger.
                                                                                    When the DMASZ counts down to zero an
                                                                                    event can be generated. After the
                                                                                    last transfer the DMASA, DMADA, DAMSZ
                                                                                    registers are restored to its initial
                                                                                    value and the DMAEN stays enabled. */
/* I2S0_SPGDMARXCTL[DMADSTWDTH] Bits */
#define I2S0_SPGDMARXCTL_DMADSTWDTH_OFS          (28)                            /* !< DMADSTWDTH Offset */
#define I2S0_SPGDMARXCTL_DMADSTWDTH_MASK         ((uint32_t)0x30000000U)         /* !< DMA destination width. This bit
                                                                                    selects the destination as a byte,
                                                                                    half word, word or long word. */
#define I2S0_SPGDMARXCTL_DMADSTWDTH_BYTE         ((uint32_t)0x00000000U)         /* !< Destination data width is BYTE
                                                                                    (8-bit) */
#define I2S0_SPGDMARXCTL_DMADSTWDTH_HALF         ((uint32_t)0x10000000U)         /* !< Destination data width is HALF-WORD
                                                                                    (16-bit) */
#define I2S0_SPGDMARXCTL_DMADSTWDTH_WORD         ((uint32_t)0x20000000U)         /* !< Destination data width is WORD
                                                                                    (32-bit) */

/* I2S0_SPGDMATXSZ Bits */
/* I2S0_SPGDMATXSZ[SIZE] Bits */
#define I2S0_SPGDMATXSZ_SIZE_OFS                 (0)                             /* !< SIZE Offset */
#define I2S0_SPGDMATXSZ_SIZE_MASK                ((uint32_t)0x0000FFFFU)         /* !< DMA Channel Size in number of
                                                                                    transfers */
#define I2S0_SPGDMATXSZ_SIZE_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2S0_SPGDMATXSZ_SIZE_MAXIMUM             ((uint32_t)0x0000FFFFU)         /* !< Highest possible value */

/* I2S0_SPGDMATXSA Bits */
/* I2S0_SPGDMATXSA[ADDR] Bits */
#define I2S0_SPGDMATXSA_ADDR_OFS                 (0)                             /* !< ADDR Offset */
#define I2S0_SPGDMATXSA_ADDR_MASK                ((uint32_t)0xFFFFFFFFU)         /* !< DMA Channel Destination Address */
#define I2S0_SPGDMATXSA_ADDR_MINIMUM             ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2S0_SPGDMATXSA_ADDR_MAXIMUM             ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* I2S0_SPGDMATXCTL Bits */
/* I2S0_SPGDMATXCTL[DMAEN] Bits */
#define I2S0_SPGDMATXCTL_DMAEN_OFS               (1)                             /* !< DMAEN Offset */
#define I2S0_SPGDMATXCTL_DMAEN_MASK              ((uint32_t)0x00000002U)         /* !< DMA enable */
#define I2S0_SPGDMATXCTL_DMAEN_DISABLE           ((uint32_t)0x00000000U)         /* !< DMA channel disabled */
#define I2S0_SPGDMATXCTL_DMAEN_ENABLE            ((uint32_t)0x00000002U)         /* !< DMA channel enabled */
/* I2S0_SPGDMATXCTL[DMAMEMINCR] Bits */
#define I2S0_SPGDMATXCTL_DMAMEMINCR_OFS          (20)                            /* !< DMAMEMINCR Offset */
#define I2S0_SPGDMATXCTL_DMAMEMINCR_MASK         ((uint32_t)0x00100000U)         /* !< DMA destination increment. This bit
                                                                                    selects automatic incrementing or
                                                                                    decrementing of the destination
                                                                                    address DMADA for each transfer. The
                                                                                    amount of change to the DMADA is
                                                                                    based on the definitin in the
                                                                                    DMADSTWDTH. For example an increment
                                                                                    of 1 (+1) on a WORD transfer will
                                                                                    increment the DMADA by 4. */
#define I2S0_SPGDMATXCTL_DMAMEMINCR_INCREMENT    ((uint32_t)0x00000000U)         /* !< Incremented by 1 (+1 * DMASRCWDTH) */
#define I2S0_SPGDMATXCTL_DMAMEMINCR_DECREMENT    ((uint32_t)0x00100000U)         /* !< Decremented by 1 (-1 * DMASRCWDTH) */
/* I2S0_SPGDMATXCTL[DMAPREIRQ] Bits */
#define I2S0_SPGDMATXCTL_DMAPREIRQ_OFS           (24)                            /* !< DMAPREIRQ Offset */
#define I2S0_SPGDMATXCTL_DMAPREIRQ_MASK          ((uint32_t)0x01000000U)         /* !< Enable an early IRQ event. This can
                                                                                    help software to react quicker to and
                                                                                    DMA done event or allows some
                                                                                    additional configuration before the
                                                                                    channel is complete.   Note: This
                                                                                    register is only available in a
                                                                                    FULL-channel configuration. Please
                                                                                    consult the datasheet of the specific
                                                                                    device to map which channel number
                                                                                    has FULL or BASIC capability. In a
                                                                                    BASIC configuration this register is
                                                                                    a read only value and always reads as
                                                                                    0x0. */
#define I2S0_SPGDMATXCTL_DMAPREIRQ_PREIRQ_DISABLE ((uint32_t)0x00000000U)         /* !< Pre-IRQ event disabled. */
#define I2S0_SPGDMATXCTL_DMAPREIRQ_PREIRQ_HALF   ((uint32_t)0x01000000U)         /* !< Issure Pre-IRQ event when DMASZ
                                                                                    reached the half size point of the
                                                                                    original transfer size */
/* I2S0_SPGDMATXCTL[DMATM] Bits */
#define I2S0_SPGDMATXCTL_DMATM_OFS               (27)                            /* !< DMATM Offset */
#define I2S0_SPGDMATXCTL_DMATM_MASK              ((uint32_t)0x08000000U)         /* !< DMA transfer mode register  Note:
                                                                                    The repeat-single (2h) and
                                                                                    repeat-block (3h) transfer are only
                                                                                    available in a FULL-channel
                                                                                    configuration. Please consult the
                                                                                    datasheet of the specific device to
                                                                                    map which channel number has FULL or
                                                                                    BASIC capability. In a BASIC channel
                                                                                    configuration only the values for
                                                                                    single (0h) and block (1h) transfer
                                                                                    can be set. */
#define I2S0_SPGDMATXCTL_DMATM_SINGLE            ((uint32_t)0x00000000U)         /* !< Single transfer. Each transfers
                                                                                    requires a new trigger. When the
                                                                                    DMASZ counts down to zero an event
                                                                                    can be generated and the DMAEN is
                                                                                    cleared. */
#define I2S0_SPGDMATXCTL_DMATM_RPTSNGL           ((uint32_t)0x08000000U)         /* !< Repeated single transfer. Each
                                                                                    transfers requires a new trigger.
                                                                                    When the DMASZ counts down to zero an
                                                                                    event can be generated. After the
                                                                                    last transfer the DMASA, DMADA, DAMSZ
                                                                                    registers are restored to its initial
                                                                                    value and the DMAEN stays enabled. */
/* I2S0_SPGDMATXCTL[DMASRCWDTH] Bits */
#define I2S0_SPGDMATXCTL_DMASRCWDTH_OFS          (28)                            /* !< DMASRCWDTH Offset */
#define I2S0_SPGDMATXCTL_DMASRCWDTH_MASK         ((uint32_t)0x30000000U)         /* !< DMA source width. This bit selects
                                                                                    the source data width as a byte, half
                                                                                    word, word or long word. */
#define I2S0_SPGDMATXCTL_DMASRCWDTH_BYTE         ((uint32_t)0x00000000U)         /* !< Source data width is BYTE (8-bit) */
#define I2S0_SPGDMATXCTL_DMASRCWDTH_HALF         ((uint32_t)0x10000000U)         /* !< Source data width is HALF-WORD
                                                                                    (16-bit) */
#define I2S0_SPGDMATXCTL_DMASRCWDTH_WORD         ((uint32_t)0x20000000U)         /* !< Source data width is WORD (32-bit) */

/* I2S0_IIDX Bits */
/* I2S0_IIDX[STAT] Bits */
#define I2S0_IIDX_STAT_OFS                       (0)                             /* !< STAT Offset */
#define I2S0_IIDX_STAT_MASK                      ((uint32_t)0x000000FFU)         /* !< Module Interrupt Vector Value.
                                                                                    This register provides the highes
                                                                                    priority interrupt index. A read
                                                                                    clears the corresponding interrupt
                                                                                    flag in RIS and MIS registers.
                                                                                    15h-1Fh = Reserved */
#define I2S0_IIDX_STAT_NO_INTR                   ((uint32_t)0x00000000U)         /* !< No interrupt pending */
#define I2S0_IIDX_STAT_WCLKERR                   ((uint32_t)0x00000001U)         /* !< WCLK Error */
#define I2S0_IIDX_STAT_RXIFG                     ((uint32_t)0x00000002U)         /* !< Receive interrupt; Interrupt Flag:
                                                                                    RX */
#define I2S0_IIDX_STAT_TXIFG                     ((uint32_t)0x00000003U)         /* !< Transmit interrupt; Interrupt Flag:
                                                                                    TX */
#define I2S0_IIDX_STAT_RXFIFO_OFV_EVT            ((uint32_t)0x00000004U)         /* !< RX FIFO Overflow Event/interrupt
                                                                                    pending */
#define I2S0_IIDX_STAT_TXFIFO_UNF_EVT            ((uint32_t)0x00000005U)         /* !< TX FIFO underflow interrupt */
#define I2S0_IIDX_STAT_DMA_DONE_RX               ((uint32_t)0x00000010U)         /* !< DMA DONE on RX */
#define I2S0_IIDX_STAT_DMA_DONE_TX               ((uint32_t)0x00000011U)         /* !< DMA DONE on TX */
#define I2S0_IIDX_STAT_DMA_PREIRQ_RX             ((uint32_t)0x00000013U)         /* !< DMA PRE IRQ INTERRUPT */
#define I2S0_IIDX_STAT_DMA_PREIRQ_TX             ((uint32_t)0x00000014U)         /* !< DMA PRE IRQ INTERRUPT */

/* I2S0_IMASK Bits */
/* I2S0_IMASK[WCLKERR] Bits */
#define I2S0_IMASK_WCLKERR_OFS                   (0)                             /* !< WCLKERR Offset */
#define I2S0_IMASK_WCLKERR_MASK                  ((uint32_t)0x00000001U)         /* !< WCLKERR interrupt mask */
#define I2S0_IMASK_WCLKERR_DIS                   ((uint32_t)0x00000000U)         /* !< Disable the interrupt mask */
#define I2S0_IMASK_WCLKERR_EN                    ((uint32_t)0x00000001U)         /* !< Enable the interrupt mask */
/* I2S0_IMASK[RXINT] Bits */
#define I2S0_IMASK_RXINT_OFS                     (1)                             /* !< RXINT Offset */
#define I2S0_IMASK_RXINT_MASK                    ((uint32_t)0x00000002U)         /* !< Enable Receive Interrupt. */
#define I2S0_IMASK_RXINT_CLR                     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S0_IMASK_RXINT_SET                     ((uint32_t)0x00000002U)         /* !< Set Interrupt Mask */
/* I2S0_IMASK[TXINT] Bits */
#define I2S0_IMASK_TXINT_OFS                     (2)                             /* !< TXINT Offset */
#define I2S0_IMASK_TXINT_MASK                    ((uint32_t)0x00000004U)         /* !< Enable Transmit Interrupt. */
#define I2S0_IMASK_TXINT_CLR                     ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S0_IMASK_TXINT_SET                     ((uint32_t)0x00000004U)         /* !< Set Interrupt Mask */
/* I2S0_IMASK[RXFIFO_OVF] Bits */
#define I2S0_IMASK_RXFIFO_OVF_OFS                (3)                             /* !< RXFIFO_OVF Offset */
#define I2S0_IMASK_RXFIFO_OVF_MASK               ((uint32_t)0x00000008U)         /* !< RXFIFO overflow event mask. */
#define I2S0_IMASK_RXFIFO_OVF_CLR                ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S0_IMASK_RXFIFO_OVF_SET                ((uint32_t)0x00000008U)         /* !< Set Interrupt Mask */
/* I2S0_IMASK[TXFIFO_UNF] Bits */
#define I2S0_IMASK_TXFIFO_UNF_OFS                (4)                             /* !< TXFIFO_UNF Offset */
#define I2S0_IMASK_TXFIFO_UNF_MASK               ((uint32_t)0x00000010U)         /* !< TX FIFO underflow interrupt mask */
#define I2S0_IMASK_TXFIFO_UNF_CLR                ((uint32_t)0x00000000U)         /* !< Clear Interrupt Mask */
#define I2S0_IMASK_TXFIFO_UNF_SET                ((uint32_t)0x00000010U)         /* !< Set Interrupt Mask */

