TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_i2s0.h
/* I2S0_RIS Bits */
/* I2S0_RIS[WCLKERR] Bits */
#define I2S0_RIS_WCLKERR_OFS                     (0)                             /* !< WCLKERR Offset */
#define I2S0_RIS_WCLKERR_MASK                    ((uint32_t)0x00000001U)         /* !< This interrupt is set when:  - An
                                                                                    unexpected **WCLK** edge occurs
                                                                                    during the data delay period of a
                                                                                    phase.  Note unexpected **WCLK**
                                                                                    edges during the word and idle
                                                                                    periods of the phase are not
                                                                                    detected. -  In dual-phase mode, when
                                                                                    two **WCLK** edges are less than 4
                                                                                    **BCLK** cycles apart. -  In
                                                                                    single-phase mode, when a **WCLK**
                                                                                    pulse occurs before the last channel.
                                                                                    This error requires a complete
                                                                                    restart since word synchronization
                                                                                    has been lost. */
#define I2S0_RIS_WCLKERR_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S0_RIS_WCLKERR_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* I2S0_RIS[RXINT] Bits */
#define I2S0_RIS_RXINT_OFS                       (1)                             /* !< RXINT Offset */
#define I2S0_RIS_RXINT_MASK                      ((uint32_t)0x00000002U)         /* !< Receive Interrupt. */
#define I2S0_RIS_RXINT_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S0_RIS_RXINT_SET                       ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* I2S0_RIS[TXINT] Bits */
#define I2S0_RIS_TXINT_OFS                       (2)                             /* !< TXINT Offset */
#define I2S0_RIS_TXINT_MASK                      ((uint32_t)0x00000004U)         /* !< Transmit Interrupt. */
#define I2S0_RIS_TXINT_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S0_RIS_TXINT_SET                       ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* I2S0_RIS[RXFIFO_OVF] Bits */
#define I2S0_RIS_RXFIFO_OVF_OFS                  (3)                             /* !< RXFIFO_OVF Offset */
#define I2S0_RIS_RXFIFO_OVF_MASK                 ((uint32_t)0x00000008U)         /* !< RXFIFO overflow event. This
                                                                                    interrupt is set if an RX FIFO
                                                                                    overflow has been detected. */
#define I2S0_RIS_RXFIFO_OVF_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S0_RIS_RXFIFO_OVF_SET                  ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* I2S0_RIS[TXFIFO_UNF] Bits */
#define I2S0_RIS_TXFIFO_UNF_OFS                  (4)                             /* !< TXFIFO_UNF Offset */
#define I2S0_RIS_TXFIFO_UNF_MASK                 ((uint32_t)0x00000010U)         /* !< TX FIFO Underflow Interrupt */
#define I2S0_RIS_TXFIFO_UNF_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S0_RIS_TXFIFO_UNF_SET                  ((uint32_t)0x00000010U)         /* !< Interrupt occurred */

/* I2S0_MIS Bits */
/* I2S0_MIS[WCLKERR] Bits */
#define I2S0_MIS_WCLKERR_OFS                     (0)                             /* !< WCLKERR Offset */
#define I2S0_MIS_WCLKERR_MASK                    ((uint32_t)0x00000001U)         /* !< This interrupt is set when:  - An
                                                                                    unexpected **WCLK** edge occurs
                                                                                    during the data delay period of a
                                                                                    phase.  Note unexpected **WCLK**
                                                                                    edges during the word and idle
                                                                                    periods of the phase are not
                                                                                    detected. -  In dual-phase mode, when
                                                                                    two **WCLK** edges are less than 4
                                                                                    **BCLK** cycles apart. -  In
                                                                                    single-phase mode, when a **WCLK**
                                                                                    pulse occurs before the last channel.
                                                                                    This error requires a complete
                                                                                    restart since word synchronization
                                                                                    has been lost. */
#define I2S0_MIS_WCLKERR_CLR                     ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S0_MIS_WCLKERR_SET                     ((uint32_t)0x00000001U)         /* !< Interrupt occured */
/* I2S0_MIS[RXINT] Bits */
#define I2S0_MIS_RXINT_OFS                       (1)                             /* !< RXINT Offset */
#define I2S0_MIS_RXINT_MASK                      ((uint32_t)0x00000002U)         /* !< Masked Receive Interrupt. */
#define I2S0_MIS_RXINT_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S0_MIS_RXINT_SET                       ((uint32_t)0x00000002U)         /* !< Interrupt occured */
/* I2S0_MIS[TXINT] Bits */
#define I2S0_MIS_TXINT_OFS                       (2)                             /* !< TXINT Offset */
#define I2S0_MIS_TXINT_MASK                      ((uint32_t)0x00000004U)         /* !< Masked Transmit Interrupt. */
#define I2S0_MIS_TXINT_CLR                       ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S0_MIS_TXINT_SET                       ((uint32_t)0x00000004U)         /* !< Interrupt occured */
/* I2S0_MIS[DMA_DONE_RX] Bits */
#define I2S0_MIS_DMA_DONE_RX_OFS                 (15)                            /* !< DMA_DONE_RX Offset */
#define I2S0_MIS_DMA_DONE_RX_MASK                ((uint32_t)0x00008000U)         /* !< Masked DMA Done on RX Event Channel
                                                                                    Interrupt */
#define I2S0_MIS_DMA_DONE_RX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S0_MIS_DMA_DONE_RX_SET                 ((uint32_t)0x00008000U)         /* !< Interrupt occured */
/* I2S0_MIS[DMA_DONE_TX] Bits */
#define I2S0_MIS_DMA_DONE_TX_OFS                 (16)                            /* !< DMA_DONE_TX Offset */
#define I2S0_MIS_DMA_DONE_TX_MASK                ((uint32_t)0x00010000U)         /* !< Masked DMA Done on TX Event Channel
                                                                                    Interrupt */
#define I2S0_MIS_DMA_DONE_TX_CLR                 ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S0_MIS_DMA_DONE_TX_SET                 ((uint32_t)0x00010000U)         /* !< Interrupt occured */
/* I2S0_MIS[RXFIFO_OVF] Bits */
#define I2S0_MIS_RXFIFO_OVF_OFS                  (3)                             /* !< RXFIFO_OVF Offset */
#define I2S0_MIS_RXFIFO_OVF_MASK                 ((uint32_t)0x00000008U)         /* !< Masked RXFIFO overflow event. This
                                                                                    interrupt is set if an RX FIFO
                                                                                    overflow has been detected. */
#define I2S0_MIS_RXFIFO_OVF_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S0_MIS_RXFIFO_OVF_SET                  ((uint32_t)0x00000008U)         /* !< Interrupt occurred */
/* I2S0_MIS[TXFIFO_UNF] Bits */
#define I2S0_MIS_TXFIFO_UNF_OFS                  (4)                             /* !< TXFIFO_UNF Offset */
#define I2S0_MIS_TXFIFO_UNF_MASK                 ((uint32_t)0x00000010U)         /* !< TX FIFO underflow interrupt */
#define I2S0_MIS_TXFIFO_UNF_CLR                  ((uint32_t)0x00000000U)         /* !< Interrupt did not occur */
#define I2S0_MIS_TXFIFO_UNF_SET                  ((uint32_t)0x00000010U)         /* !< Interrupt occurred */

/* I2S0_ISET Bits */
/* I2S0_ISET[WCLKERR] Bits */
#define I2S0_ISET_WCLKERR_OFS                    (0)                             /* !< WCLKERR Offset */
#define I2S0_ISET_WCLKERR_MASK                   ((uint32_t)0x00000001U)         /* !< This field sets the interrupt
                                                                                    WCLKERR */
#define I2S0_ISET_WCLKERR_NOEFF                  ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S0_ISET_WCLKERR_SET                    ((uint32_t)0x00000001U)         /* !< Set interrupt */
/* I2S0_ISET[RXINT] Bits */
#define I2S0_ISET_RXINT_OFS                      (1)                             /* !< RXINT Offset */
#define I2S0_ISET_RXINT_MASK                     ((uint32_t)0x00000002U)         /* !< Set Receive Interrupt. */
#define I2S0_ISET_RXINT_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S0_ISET_RXINT_SET                      ((uint32_t)0x00000002U)         /* !< Set Interrupt */
/* I2S0_ISET[TXINT] Bits */
#define I2S0_ISET_TXINT_OFS                      (2)                             /* !< TXINT Offset */
#define I2S0_ISET_TXINT_MASK                     ((uint32_t)0x00000004U)         /* !< Set Transmit Interrupt. */
#define I2S0_ISET_TXINT_NO_EFFECT                ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S0_ISET_TXINT_SET                      ((uint32_t)0x00000004U)         /* !< Set Interrupt */
/* I2S0_ISET[RXFIFO_OVF] Bits */
#define I2S0_ISET_RXFIFO_OVF_OFS                 (3)                             /* !< RXFIFO_OVF Offset */
#define I2S0_ISET_RXFIFO_OVF_MASK                ((uint32_t)0x00000008U)         /* !< Set RXFIFO overflow event. */
#define I2S0_ISET_RXFIFO_OVF_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing 0 has no effect */
#define I2S0_ISET_RXFIFO_OVF_SET                 ((uint32_t)0x00000008U)         /* !< Set Interrupt */
/* I2S0_ISET[TXFIFO_UNF] Bits */
#define I2S0_ISET_TXFIFO_UNF_OFS                 (4)                             /* !< TXFIFO_UNF Offset */
#define I2S0_ISET_TXFIFO_UNF_MASK                ((uint32_t)0x00000010U)         /* !< Set TX FIFO Underflow Event */
#define I2S0_ISET_TXFIFO_UNF_NO_EFFECT           ((uint32_t)0x00000000U)         /* !< Writing has no effect */
#define I2S0_ISET_TXFIFO_UNF_SET                 ((uint32_t)0x00000010U)         /* !< Set interrupt */

