TexasInstruments/msp-hal_ti/mspm33/source/ti/devices/msp/peripherals/hw_i2s0.h
/* I2S0_TXDATA Bits */
/* I2S0_TXDATA[DATA] Bits */
#define I2S0_TXDATA_DATA_OFS                     (0)                             /* !< DATA Offset */
#define I2S0_TXDATA_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< Data Transmitted or Received  Data
                                                                                    that is to be transmitted via the
                                                                                    UART is written to this field.  When
                                                                                    read, this field contains the data
                                                                                    that was received by the UART. */
#define I2S0_TXDATA_DATA_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2S0_TXDATA_DATA_MAXIMUM                 ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* I2S0_RXDATA Bits */
/* I2S0_RXDATA[DATA] Bits */
#define I2S0_RXDATA_DATA_OFS                     (0)                             /* !< DATA Offset */
#define I2S0_RXDATA_DATA_MASK                    ((uint32_t)0xFFFFFFFFU)         /* !< Received Data.  When read, this
                                                                                    field contains the data that was
                                                                                    received by the UART. */
#define I2S0_RXDATA_DATA_MINIMUM                 ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2S0_RXDATA_DATA_MAXIMUM                 ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* I2S0_WMASK0 Bits */
/* I2S0_WMASK0[MASK] Bits */
#define I2S0_WMASK0_MASK_OFS                     (0)                             /* !< MASK Offset */
#define I2S0_WMASK0_MASK_MASK                    ((uint32_t)0x0000FFFFU)         /* !< Bit-mask indicating valid channels
                                                                                    in a frame on AD0.  In single-phase
                                                                                    mode, each bit represents one
                                                                                    channel, starting with **LSB** for
                                                                                    the first word in the frame. A frame
                                                                                    can contain up to 8/16 channels based
                                                                                    on SoC configuration.  Channels that
                                                                                    are not included in the mask will not
                                                                                    be sampled nor stored in memory; data
                                                                                    clocked out in these slots is as per
                                                                                    configured EMPTYSLOTOUTPUT.  In
                                                                                    dual-phase mode, only the two
                                                                                    **LSB**s are considered. For a stereo
                                                                                    configuration, set both bits. For a
                                                                                    mono configuration, set bit 0 only.
                                                                                    In mono mode, only channel 0 will be
                                                                                    sampled and stored to memory, and
                                                                                    channel 0 will be repeated when
                                                                                    clocked out.  In mono mode, only
                                                                                    channel 0 will be sampled and stored
                                                                                    to memory, and channel 0 will be
                                                                                    repeated in the second phase when
                                                                                    clocked out.  If all bits are zero,
                                                                                    no input words will be stored to
                                                                                    memory, and the output data lines
                                                                                    will be constant '0'. This can be
                                                                                    utilized when **PWM** debug output is
                                                                                    desired without any actively used
                                                                                    output pins. */

/* I2S0_WMASK1 Bits */
/* I2S0_WMASK1[MASK] Bits */
#define I2S0_WMASK1_MASK_OFS                     (0)                             /* !< MASK Offset */
#define I2S0_WMASK1_MASK_MASK                    ((uint32_t)0x0000FFFFU)         /* !< Bit-mask indicating valid channels
                                                                                    in a frame on AD1.  In single-phase
                                                                                    mode, each bit represents one
                                                                                    channel, starting with **LSB** for
                                                                                    the first word in the frame. A frame
                                                                                    can contain up to 8/16 channels based
                                                                                    on SoC configuration.  Channels that
                                                                                    are not included in the mask will not
                                                                                    be sampled nor stored in memory; data
                                                                                    clocked out in these slots is as per
                                                                                    configured EMPTYSLOTOUTPUT.  In
                                                                                    dual-phase mode, only the two
                                                                                    **LSB**s are considered. For a stereo
                                                                                    configuration, set both bits. For a
                                                                                    mono configuration, set bit 0 only.
                                                                                    In mono mode, only channel 0 will be
                                                                                    sampled and stored to memory, and
                                                                                    channel 0 will be repeated when
                                                                                    clocked out.  In mono mode, only
                                                                                    channel 0 will be sampled and stored
                                                                                    to memory, and channel 0 will be
                                                                                    repeated in the second phase when
                                                                                    clocked out.  If all bits are zero,
                                                                                    no input words will be stored to
                                                                                    memory, and the output data lines
                                                                                    will be constant '0'. This can be
                                                                                    utilized when **PWM** debug output is
                                                                                    desired without any actively used
                                                                                    output pins. */

/* I2S0_MCLKDIV Bits */
/* I2S0_MCLKDIV[MDIV] Bits */
#define I2S0_MCLKDIV_MDIV_OFS                    (0)                             /* !< MDIV Offset */
#define I2S0_MCLKDIV_MDIV_MASK                   ((uint32_t)0x000003FFU)         /* !< An unsigned factor of the division
                                                                                    ratio used to generate **MCLK**
                                                                                    [2-1024]:
                                                                                    **MCLK** =
                                                                                    MCUCLK/MDIV[Hz] **MCUCLK** is upto
                                                                                    96MHz.
                                                                                    A value of 0 is
                                                                                    interpreted as 1024.
                                                                                    A value of
                                                                                    1 is invalid.
                                                                                    If MDIV is odd
                                                                                    the low phase of the clock is one
                                                                                    **MCUCLK** period longer than the
                                                                                    high phase. */

/* I2S0_WCLKDIV Bits */
/* I2S0_WCLKDIV[WDIV] Bits */
#define I2S0_WCLKDIV_WDIV_OFS                    (0)                             /* !< WDIV Offset */
#define I2S0_WCLKDIV_WDIV_MASK                   ((uint32_t)0x0000FFFFU)         /* !< If[CLKCTL.WCLKPHASE]= 0, Single
                                                                                    phase. **WCLK**is high
                                                                                    one**BCLK**period and low WDIV[9:0]
                                                                                    (unsigned, [1-1023])**BCLK**periods.
                                                                                    
                                                                                    **WCLK**=**MCUCLK**/
                                                                                    BDIV*(WDIV[9:0] + 1) [Hz]
                                                                                    **MCUCLK**upto 96MHz.
                                                                                    
                                                                                    If[CLKCTL.WCLKPHASE.*]= 1, Dual
                                                                                    phase. Each phase on**WCLK**(50% duty
                                                                                    cycle) is WDIV[9:0] (unsigned,
                                                                                    [1-1023])**BCLK**periods.
                                                                                    
                                                                                    **WCLK**=**MCUCLK**/
                                                                                    BDIV*(2*WDIV[9:0]) [Hz]
                                                                                    
                                                                                    If[CLKCTL.WCLKPHASE.*] = 2, User
                                                                                    defined. **WCLK**is high WDIV[7:0]
                                                                                    (unsigned, [1-255])**BCLK**periods
                                                                                    and low WDIV[15:8] (unsigned,
                                                                                    [1-255])**BCLK**periods.
                                                                                    
